src/Documents/инкПриказНаОтпуск/инкПриказНаОтпуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>инкПриказНаОтпуск</name>
  <registerRecords>InformationRegister.инкРеестрКадровыхДокументов</registerRecords>
  <attributes>
    <name>ВидДополнительногоОтпуска</name>
    <type>
      <types>EnumRef.инкВидыОтпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтпуска</name>
    <type>
      <types>EnumRef.инкВидыОтпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.инкДолжности</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейДополнительногоОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>EnumRef.инкОснованияДляОтпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПОДопОтпуск</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПОЗаРабочийГод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСДопОтпуск</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСЗаРабочийГод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/инкПриказНаОтпуск/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда
		ЗаполнитьЗначенияСвойств(Объект,Параметры.ЗначенияЗаполнения);
		СотрудникПриИзмененииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	СотрудникПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	инкКадровыйУчетСервер.ЗагрузитьДанныеПоСотрудникуНаСервере(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСПриИзменении(Элемент)
	РасчетКоличестваДней();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПОПриИзменении(Элемент)
	РасчетКоличестваДней();
КонецПроцедуры

&НаКлиенте
Процедура ПериодСДопОтпускПриИзменении(Элемент)
	РасчетКоличестваДней();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПОДопОтпускПриИзменении(Элемент)
	РасчетКоличестваДней();
КонецПроцедуры

&НаКлиенте
Процедура ВидДополнительногоОтпускаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ВидДополнительногоОтпуска) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ПериодСДопОтпуск) И ЗначениеЗаполнено(Объект.ПериодПО) Тогда
			Объект.ПериодСДопОтпуск = КонецДня(Объект.ПериодПО) + 1;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчетКоличестваДней()
	
	Объект.КоличествоДнейОтпуска = инкУчетВремениСервер.ПолучитьРазницуВДнях(Объект.ПериодС,Объект.ПериодПО,Ложь);	
	Объект.КоличествоДнейДополнительногоОтпуска = инкУчетВремениСервер.ПолучитьРазницуВДнях(Объект.ПериодСДопОтпуск,Объект.ПериодПОДопОтпуск,Ложь);	

КонецПроцедуры

#Область о // Печать документов:

&НаКлиенте
Процедура ПечатьТ6(Команда)
	
	ТабличныйДокумент = ПечатьДокументовНаСервере("Т6");
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Приказ о предоставлении отпуска работнику Т-6",ЭтаФорма);
	
КонецПроцедуры                      

&НаСервере
Функция ПечатьДокументовНаСервере(ИмяОтчета)
	
	МенеджерПечати = Обработки.инкПечатьПриказНаОтпуск.Создать();
	Возврат МенеджерПечати.ПолучитьПечатныйДокументНаСервере(Объект,ИмяОтчета);
	
КонецФункции

#КонецОбласти

#КонецОбласти
